-- 2. Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
-- Таблицы: `Н_ЛЮДИ`, `Н_ВЕДОМОСТИ`, `Н_СЕССИЯ`.
-- Вывести атрибуты: `Н_ЛЮДИ.ФАМИЛИЯ`, `Н_ВЕДОМОСТИ.ДАТА`, `Н_СЕССИЯ.ДАТА`.
-- Фильтры **AND**:
-- a) `Н_ЛЮДИ.ОТЧЕСТВО` = **Владимирович**.
-- b) `Н_ВЕДОМОСТИ.ЧЛВК_ИД` < **163249**.
-- c) `Н_СЕССИЯ.ЧЛВК_ИД` = **126631**.
-- Вид соединения: **RIGHT JOIN**.

SELECT "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ВЕДОМОСТИ"."ДАТА", "Н_СЕССИЯ"."ДАТА" FROM "Н_ЛЮДИ"
RIGHT JOIN "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
RIGHT JOIN "Н_СЕССИЯ" on "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE
        "Н_ЛЮДИ"."ОТЧЕСТВО" = 'Владимирович' AND
        "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 163249 AND
        "Н_СЕССИЯ"."ЧЛВК_ИД" = 126631;